---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.SpaceUnplaceWarning
source: html/ccf50328-eb14-8474-e0cb-2142d96bab73.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.SpaceUnplaceWarning Property

A Space was deleted from all model views but still remains in this project. \n The Space can be removed from any schedule or placed back in the model using the Space command.

## Syntax (C#)
```csharp
public static FailureDefinitionId SpaceUnplaceWarning { get; }
```